# Системные вызовы

## [Задание 1](./src/task1)
### Проведите следующие эксперименты:
> a. запустите программу hello world из предыдущей задачи под strace:
> 
>> i. обратите внимание какие системные вызовы были вызваны в
процессе исполнения программы. Чем обусловлено такое
количество системных вызовов. Какой системный вызов
используется для вывода “hello world”? Изучите этот вызов и
разберитесь что он принимает и возвращает.
>
>> ii. используйте этот сискол в программе *hello world* вместо `printf()`.
Убедитесь что этот вызов присутствует в выводе strace.
>
>> iii. напишите свою обертку над этим сисколом. Для этого
используйте функцию `syscall()` из libc. 
Также проверьте вывод strace.
>
> b. Запустите под strace команду `‘wget kernel.org’` (если нет wget,
используйте curl). Получите статистику использования системных
вызовов порожденным процессом

## [Задание 2](./src/task2)
Разберитесь как устроена функция `syscall()`. 

Напишите код, который напечатает
**hello world** без использования функции `syscall()`.


## [Задание 3](./src/task3)
Разберитесь как работает системный вызов `ptrace(2)` и напишите программу,
которая породит процесс и выведет все системные вызовы дочернего процесса.
